#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-MksZVnHSAxe8sNb2

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js.map"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css"]: Refreshing state... [id=static/css/main.61b89840.css]
module.web.aws_s3_object.upload_webapp["static/js/612.7a501a2d.chunk.js"]: Refreshing state... [id=static/js/612.7a501a2d.chunk.js]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/518.86d0a8b8.chunk.js"]: Refreshing state... [id=static/js/518.86d0a8b8.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/777.107dea8d.chunk.js"]: Refreshing state... [id=static/js/777.107dea8d.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/518.86d0a8b8.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/518.86d0a8b8.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css.map"]: Refreshing state... [id=static/css/main.61b89840.css.map]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js"]: Refreshing state... [id=static/js/726.51f7dd57.chunk.js]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/main.37b73713.js"]: Refreshing state... [id=static/js/main.37b73713.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/js/518.86d0a8b8.chunk.js.map"]: Refreshing state... [id=static/js/518.86d0a8b8.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/106.8390d3bf.chunk.js"]: Refreshing state... [id=static/js/106.8390d3bf.chunk.js]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/612.7a501a2d.chunk.js.map"]: Refreshing state... [id=static/js/612.7a501a2d.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/106.8390d3bf.chunk.js.map"]: Refreshing state... [id=static/js/106.8390d3bf.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/777.107dea8d.chunk.js.map"]: Refreshing state... [id=static/js/777.107dea8d.chunk.js.map]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js"]: Refreshing state... [id=static/js/924.16f99540.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css"]: Refreshing state... [id=static/css/612.11e8f03c.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js.map"]: Refreshing state... [id=static/js/924.16f99540.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/612.11e8f03c.chunk.css.map"]: Refreshing state... [id=static/css/612.11e8f03c.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/main.37b73713.js.map"]: Refreshing state... [id=static/js/main.37b73713.js.map]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.37b73713.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.37b73713.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.37b73713.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.37b73713.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/css/main.61b89840.css.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.37b73713.js.LICENSE.txt"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "72a7e9e4847f08a72659f49381acab4b" -> "a378b14aac77ebf5a4c5c0b96f6b2b05"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "O749_2z_GRQp3VtjDG_LjUq1zQ7yeUnr" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "3144d30b85410fb2903a908cfd557652" -> "1c5fe2c93e51b6b6cbf05397a905702b"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "ehjboXhONTf2hlhVY.yt9CO3BA1Xn51n" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/612.7a501a2d.chunk.js"] will be destroyed
  # (because key ["static/js/612.7a501a2d.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "a850cdf98df9eb85331c956499a6d0ab" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/612.7a501a2d.chunk.js" -> null
      - key                    = "static/js/612.7a501a2d.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/612.7a501a2d.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "bKvZvyfDqA4yHIE7XokAfL8T_Jz0AbQ9" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/612.7a501a2d.chunk.js.map"] will be destroyed
  # (because key ["static/js/612.7a501a2d.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "4ca72bc7559d80bf354f672ba1a74130" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/612.7a501a2d.chunk.js.map" -> null
      - key                    = "static/js/612.7a501a2d.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/612.7a501a2d.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "qM27rTYR8uhy2XLhqXWb0gRBjWJAy5US" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/612.f5fb65b5.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "bf8eaa3e05358ad738b7835696055272"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/612.f5fb65b5.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/612.f5fb65b5.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/612.f5fb65b5.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "9eddd2fab8342c0cd53dbab8a334b7dc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/612.f5fb65b5.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/612.f5fb65b5.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.239c161a.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "5f0b5253e06d3626623e9ccc1e7371e4"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.239c161a.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.239c161a.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.239c161a.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "c08095d410fcc127f60d880f425f8221"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.239c161a.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.239c161a.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.239c161a.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "c39ec13589b045cb705cc34f5fe66d23"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.239c161a.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.239c161a.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.37b73713.js"] will be destroyed
  # (because key ["static/js/main.37b73713.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "2f8a5f6edb0fc0cff80f39ea8858a586" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.37b73713.js" -> null
      - key                    = "static/js/main.37b73713.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.37b73713.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "AkVVuGKq5Ko1COaWFgii1O7mt9Kau66g" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.37b73713.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.37b73713.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "c08095d410fcc127f60d880f425f8221" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.37b73713.js.LICENSE.txt" -> null
      - key                    = "static/js/main.37b73713.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.37b73713.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "udX5Vsjaoz7iiP._C6W5swEiuUivz67E" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.37b73713.js.map"] will be destroyed
  # (because key ["static/js/main.37b73713.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "960488292974665689f01823e73c05dc" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.37b73713.js.map" -> null
      - key                    = "static/js/main.37b73713.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.37b73713.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "xa46qG4w_m0X_QvVntu.ZEnw12SqMhXC" -> null
    }

Plan: 5 to add, 2 to change, 5 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 37 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @Andrej988, Action: `pull_request`*